app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "TECH"], ["room_number", 113], ["created_at", "2019-02-25 13:40:26.401263"], ["updated_at", "2019-02-25 13:40:26.401263"]]
---
  def create
    @school_class = SchoolClass.create(student_class_params(:title, :room_number))