app/controllers/students_controller.rb

SELECT  "students".* FROM "students"  ORDER BY "students"."id" ASC LIMIT 1
---
def index
  @students = Student.all

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Dom"], ["last_name", "Masiello"], ["created_at", "2019-02-25 18:03:16.454249"], ["updated_at", "2019-02-25 18:03:16.454249"]]
---
def create
  @student = Student.create(student_class_params(:first_name, :last_name))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 14]]
UPDATE "students" SET "first_name" = ?, "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Lindsey"], ["last_name", "Stirling"], ["updated_at", "2019-02-25 18:26:41.232344"], ["id", 1]]
---
def update
  @student = Student.find(params[:id])
  @student.update(student_class_params(:first_name, :last_name))